{
  "resumes": [
    {
      "id": "3dcf3df1-c065-4059-9e99-36a925e03b16",
      "filename": "Aurora_Resume (1).docx",
      "managed_path": "/Users/stacyenot/Pawgrammer/Job-App-Tracker-v1Demo/job-app-tracker-demo/data/unassigned-resumes/2025-09-08T09-07-09-956Z_3dcf3df1_Aurora_Resume__1_.docx",
      "file_size": 8667,
      "file_extension": ".docx",
      "content_hash": "7521a32d89bebf1f1a86d5897bb30cb3975baeee76e41294c0a38aab56350e9c",
      "uploaded_at": "2025-09-08T09:07:09.957Z",
      "extraction_status": "success",
      "preview_available": true,
      "extracted_text": "Princess Aurora of Everglen\n\nFuture Ruler | Curse Breaker | Diplomat of Enchanted Realms\n\n\n\nObjective\n\nTo serve as a beacon of hope, courage, and kindness within the kingdom, while managing magical crises, uniting diverse creatures, and ensuring that all citizens (enchanted or otherwise) live happily ever after.\n\n\n\nExperience\n\nRoyal Apprentice, Everglen Kingdom Childhood – Present\n\nRepresented the royal family at balls, coronations, and public feasts.\n\nMediated disputes between woodland animals, dwarves, and talking furniture.\n\nEscaped multiple kidnappings and tower imprisonments, demonstrating resilience and crisis management.\n\nPartnered with fairy godmothers, wizards, and princes on kingdom-wide problem solving.\n\nEnchanted Forest Intern Seasonal Quests\n\nCollaborated with magical creatures to maintain forest harmony.\n\nCollected intelligence on witches, curses, and suspicious stepmothers.\n\nRescued lost villagers with guidance from birds, mice, and enchanted maps.\n\n\n\nSkills\n\nDiplomacy and alliance building; fluent in royal etiquette and animal languages (avian, rodent, dragon).\n\nCrisis management, including curse survival, troll negotiations, and spell-breaking.\n\nPublic performance: skilled in spontaneous singing and waltzing.\n\nWardrobe and presentation: able to maintain impeccable gowns in hostile conditions.\n\nLeadership: inspires loyalty in citizens and companions alike.\n\n\n\nEducation\n\nRoyal Academy of Enchanted Studies Major: Grace and Diplomacy Minor: Curse Survival and Songcraft\n\n\n\nHonors and Awards\n\n“Fairest in the Land” (peer-reviewed, annually contested).\n\nRecipient of the Happily Ever After Distinction for outstanding service in fairy-tale resolution.\n\n\n\nReferences\n\nFairy Godmother\n\nSeven Dwarves Union\n\nTalking Mirror (available upon reflection)\n\n\n\n"
    }
  ]
}